app/views/auctions/_formAuction.html.erb

SELECT "residences".* FROM "residences" ORDER BY "residences"."name" ASC
---
    <%= f.label :residence_id, 'Eliga la residencia:' %>
    <%= f.collection_select :residence_id, Residence.all, :id, :name, {}, class: 'form-control' %>