app/views/auctions/index.html.erb

	</tr>
	<% auctions = Auction.all %>
---
SELECT "auctions".* FROM "auctions"