app/controllers/auctions_controller.rb

SELECT "auctions".* FROM "auctions"
---
  def index
    @auction = Auction.all

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @auction = Auction.find(params[:id]) #Asigna la subasta id a la variable subasta

DELETE FROM "auctions" WHERE "auctions"."id" = ?  [["id", 4]]
---
  def destroy            #elimina una residencia de la base de datos
      @auction = Auction.destroy(params[:id])

INSERT INTO "auctions" ("created_at", "updated_at", "residence_id", "maxbid", "dateStart", "dateEnd") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2018-11-11 15:30:05.088826"], ["updated_at", "2018-11-11 15:30:05.088826"], ["residence_id", 1], ["maxbid", 654], ["dateStart", "2018-11-11"], ["dateEnd", "2018-11-14"]]
---
  def create
    @auction = Auction.new(params.require(:auction).permit(:residence_id, :maxbid, :dateStart))
    @auction.dateEnd =  @auction.dateStart + 3
    if @auction.save

INSERT INTO "users" ("email", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "victor@mail.com"], ["password", "12345678"], ["created_at", "2018-11-07 23:35:12.979783"], ["updated_at", "2018-11-07 23:35:12.979783"]]
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "auctions" SET "maxbid" = ?, "updated_at" = ? WHERE "auctions"."id" = ?  [["maxbid", 2584], ["updated_at", "2018-11-09 12:38:28.198860"], ["id", 1]]
---
  def update
    @user = User.new(params.require(:user).permit(:email, :password, :credits))
    #@user.credits -= 1
    @user.save

    @auction = Auction.find(params[:id])
    #@auction.user.email = params[:user][:email]
    if @auction.maxbid.nil?
      @auction.maxbid = params[:addtobid].to_f
    else
      @auction.maxbid += params[:addtobid].to_f
    end
    @auction.save

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def enterBid
    @user = User.new(credits: 2)
    if @user.credits >= 0
      @auction = Auction.find(params[:id])