app/controllers/auctions_controller.rb

  def destroy
      @auction = Auction.find(params[:id])
---
SELECT  "auctions".* FROM "auctions" WHERE "auctions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]