app/controllers/residences_controller.rb

SELECT "residences".* FROM "residences"
---
  def index
      @residence = Residence.search(params[:search])

INSERT INTO "residences" ("name", "dir", "desc", "available", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Casa de Vic"], ["dir", "Villa Elisa"], ["desc", "Muy linda casa"], ["available", 1], ["created_at", "2018-11-04 18:54:42.156123"], ["updated_at", "2018-11-04 18:54:42.156123"]]
---
  def create    #Crea una nueva residencia y la guarda en la base de datos
    @residence = Residence.new( params.require(:residence).permit(:name, :country, :province, :locality, :dir, :desc, :available, :image_url) )
    if @residence.save

DELETE FROM "residences" WHERE "residences"."id" = ?  [["id", 7]]
---
  def destroy            #elimina una residencia de la base de datos
    @residence = Residence.destroy(params[:id])

UPDATE "residences" SET "name" = ?, "desc" = ?, "dir" = ?, "available" = ?, "updated_at" = ? WHERE "residences"."id" = ?  [["name", "Maxi's House"], ["desc", "Nice Home"], ["dir", "La Plata"], ["available", 1], ["updated_at", "2018-11-04 19:09:42.253463"], ["id", 1]]
---
  def update
    @residence = Residence.find(params[:id])
    @residence.update(residence_params)