app/views/residences/index.html.erb

SELECT "residences".* FROM "residences"
---

		<% residences = Residence.all %>

SELECT "auctions".* FROM "auctions"
---
						<td><%= link_to "Edit", edit_residence_path(residence), class: 'btn btn-dark btn-sm'%></td>
						<% if Auction.exists?(residence_id: residence.id) %> <!-- Se fija si en el listado hay residencias que se encuentran en subasta -->