app/views/residences/show.html.erb

SELECT  "auctions".* FROM "auctions" WHERE "auctions"."residence_id" = ? AND "auctions"."id" = ? LIMIT ?  [["residence_id", 13], ["id", 1], ["LIMIT", 1]]
---
                    <td>  <%= (Date.commercial(@availabilities[i].year, @availabilities[i].week)+6).strftime("%d/%m/%Y") %>  </td> <!-- Esto muestra el ultimo dia de la semana que corresponde -->
                    <% if current_user.present? && current_user.isAdmin? && !Auction.exists?(:availability_id => @availabilities[i])%>